tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/* Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_app_bluetrack_main main.c
 * @{
 * @ingroup ble_app_bluetrack
 * @brief BlueTrack Hub project main file.
 *
 * This file contains the implementation for the BlueTrack Hub. This implementation
 * receives configuration, relay, and DCC commands through the BlueTrack BLE service,
 * and forwards these commands to the appropriate outputs.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "boards.h"
#include "app_scheduler.h"
#include "app_timer.h"
#include "ble_bluetrack.h"
#include "ble_dis.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_drv_gpiote.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_ppi.h"
#include "nrf_drv_saadc.h"
#include "nrf_dfu_types.h"
#include "ble_dfu.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "gatts_cache_manager.h"

#define DREKKER_DEVELOPMENT_COMPANY_ID  0x0343                                      /**< Assigned by Bluetooth SIG. */            

#define BOOTLOADER_SETTINGS_PAGE_ADDR   0x0007F000

#define MAIN_DCC_PIN_NO                 2
#define MAIN_I_SENSE_PIN_NO             3
#define BRAKE_N_PIN_NO                  26
#define RELAY_1_PIN_NO                  9
#define RELAY_2_PIN_NO                  10
#define RELAY_3_PIN_NO                  11
#define RELAY_4_PIN_NO                  12
#define RELAY_5_PIN_NO                  13
#define RELAY_6_PIN_NO                  14
#define RELAY_7_PIN_NO                  15
#define RELAY_8_PIN_NO                  16
#define RELAY_9_PIN_NO                  17
#define RELAY_10_PIN_NO                 18
#define RELAY_11_PIN_NO                 19
#define RELAY_12_PIN_NO                 20
#define RELAY_13_PIN_NO                 22
#define RELAY_14_PIN_NO                 23
#define RELAY_15_PIN_NO                 21
#define SYNC_PIN_NO                     24
#define STOP_LED_PIN_NO                 25
#define PROG_I_SENSE_PIN                26
#define PROG_DCC_PIN_NO                 27                            
#define THERMAL_N_PIN_NO                28
#define ERROR_LED_PIN_NO                29
#define BLE_LED_PIN_NO                  30
#define PROG_LED_PIN_NO                 31

#define MAIN_I_SENSE_INPUT              NRF_SAADC_INPUT_AIN1
#define PROG_I_SENSE_INPUT              NRF_SAADC_INPUT_AIN2
#define MAIN_I_SENSE_CHANNEL            0                                           /**< ADC channel used for MAIN current sense, this is also the index for the result in adc_buffer */
#define PROG_I_SENSE_CHANNEL            1                                           /**< ADC channel used for PROG current sense, this is also the index for the result in adc_buffer */
#define ADC_LIMIT                       14254                                       /**< Corresponds to 3A for minimum sensitivity and 2A for maximum sensitivity */
#define ADC_DELTA                       285                                         /**< ADC value above the baseline required to trigger an acknowledge, corresponds to 60mA for minimum sensitivity and 40mA for maximum sensitivity */

#define N_OUTPUTS                       15                                          /**< 15 Relay Outputs in total */

#define DCC_ONE_TIME_US                 58                                          /**< 58us (see S-9.1) */
#define DCC_ZERO_TIME_US                100                                         /**< 100us (see S-9.1) */

#define BLE_LED_TOGGLE_TIME_MS          500                                         /**< Advertising LED toggles every 500ms */

#define MIN_DCC_LEN                     2                                           /**< Minimum length (in bytes) of a DCC command (excluding error byte, see S-9.2.1) */
#define MAX_DCC_LEN                     5                                           /**< Maximum length (in bytes) of a DCC command (excluding error byte, see S-9.2.1) */

#define DCC_COMMAND_BUFFER_SIZE         52                                          /**< Size of DCC Command buffer, this is 32+20 for worst case service mode*/

#define ACTUATION_INTERVAL_MS           1000                                        /**< Relay actuation interval (ms) (1s seems reasonable to guarantee actuation) */

#define ADC_SAMPLE_INTERVAL_MS          0.5                                         /**< ADC sample interval (ms) (this allows at least 10 samples during a minimum 5ms feedback window, see S-9.2.3) */

#define FUNCTION_READ_BIT               0                                           /**< Enum for read_bit function */
#define FUNCTION_READ_BYTE              1                                           /**< Enum for read_byte function */
#define FUNCTION_WRITE_BIT              2                                           /**< Enum for write_bit function */
#define FUNCTION_WRITE_BYTE             3                                           /**< Enum for write_byte function */
#define MODE_DIRECT                     0                                           /**< Enum for direct mode */
#define MODE_PAGED                      1                                           /**< Enum for paged mode */
#define MODE_REGISTER                   2                                           /**< Enum for register mode */
#define MODE_ADDRESS                    3                                           /**< Enum for address mode */
#define READ_BYTE_COUNTER_MAX           255                                         /**< Maximum value for the read byte counter (maximum value of 8 bit unsigned integer) */
#define READ_BIT_COUNTER_MAX            7                                           /**< Maximum value for the read bit counter (8-1) */
#define READ_BIT_COUNTER_MAX_ADDRESS    127                                         /**< Maximum value for the read byte counter when in address mode (short address cannot be greater than 127) */

