tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
#define ADDRESS_TYPE_INVALID            0                                           /**< Enum for invalid address type */
#define ADDRESS_TYPE_BROADCAST          1                                           /**< Enum for broadcast address type */
#define ADDRESS_TYPE_SHORT_CONSIST      2                                           /**< Enum for short or consist address type */
#define ADDRESS_TYPE_LONG               3                                           /**< Enum for long address type */

#define COMMAND_REPEATS                 10                                          /**< Number of times to repeat a DCC command (arbitrary selection) */

#define SPEED_COMMAND_ARRAY_SIZE        128                                         /**< Number of addresses we can store a speed command for. This places a limitation on the number of trains we can concurrently support. */

#define MAIN                            0                                           /**< Indicates DCC commands are sent to the main track, used by both programming_track_state and programming_track_mode. */
#define PROGRAMMING                     1                                           /**< Indicates DCC commands are sent to the programming track, used by both programming_track_state and programming_track_mode. */
#define MAIN_REPEAT                     2                                           /**< Indicates repeating DCC commands are being sent to the main track in programming mode, only used by programming_track_state. */

#define DEVICE_NAME                     "BlueTrack"                                /**< Name of device. Will be included in the advertising data. Limit length to 11 to allow Master Emulator to connect (unexplained). */

#define MODEL_NUMBER                    "BlueTrack Hub"                            /**< Model number for DIS. **/
#define MANUFACTURER_NAME               "Drekker Development Pty. Ltd."            /**< Manufacturer name for DIS. **/

#define APP_BLE_OBSERVER_PRIO           3                                          /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                          /**< A tag identifying the SoftDevice BLE configuration. */

#define APP_ADV_INTERVAL                MSEC_TO_UNITS(20, UNIT_0_625_MS )          /**< The advertising interval, 20ms recommended by R12 of Accessory Design Guidelines for Apple Devices */
#define APP_ADV_DURATION                BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED      /**< Advertising duration in 10 ms units. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(45, UNIT_1_25_MS)             /**< Minimum acceptable connection interval, needed for responsiveness (45ms complies with R12 of Accessory Design Guidelines for Apple Devices). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)            /**< Maximum acceptable connection interval, needed for responsiveness. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency (0 to comply with R12 of Accessory Design Guidelines for Apple Devices). */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds to comply with R12 of Accessory Design Guidelines for Apple Devices). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000)                      /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                       /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SCHED_MAX_EVENT_DATA_SIZE       sizeof(app_timer_event_t)                   /**< Maximum size of scheduler events. Timer is our largest scheduled event (8 bytes). Note that scheduler BLE stack events do not contain any data, as the events are being pulled from the stack in the event handler. */
#define SCHED_QUEUE_SIZE                10                                          /**< Maximum number of events in the scheduler queue. This is a best guess. */

/**@brief Structure of a DCC command. */
typedef struct
{
    bool occupied;
    bool sync;
    bool feedback;
    uint32_t data0;
    uint32_t data1;
    uint32_t data2;
    uint8_t data0_count;
    uint8_t data1_count;
    uint8_t data2_count;
} dcc_command_t;

/**@brief Structure of a scheduled DCC command. */
typedef struct
{
    uint8_t byte1;
    uint8_t byte2;
    uint8_t byte3;
    uint8_t byte4;
    uint8_t byte5;
    uint8_t len;
    uint8_t feedback;
} scheduled_dcc_command_t;

BLE_BLUETRACK_DEF(m_bluetrack);                                                                   /**< Bluetrack Service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                                         /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                                           /**< Context for the Queued Write module.*/
APP_TIMER_DEF(output_timer);                                                                      /**< App Timer instance for relay output timing */
APP_TIMER_DEF(feedback_timer);                                                                    /**< App Timer instance for feedback ADC measurement timing */

const nrf_drv_timer_t                   TIMER_DCC_DATA =           NRF_DRV_TIMER_INSTANCE(1);
const nrf_drv_timer_t                   TIMER_BLE_LED =            NRF_DRV_TIMER_INSTANCE(2);
const nrf_drv_timer_t                   TIMER_DCC_CONTINOUS_ONES = NRF_DRV_TIMER_INSTANCE(3);

