tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;                  /**< Handle of the current connection. */
static uint8_t                          m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;            /**< Advertising handle used to identify an advertising set. */
static uint8_t                          m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];             /**< Buffer for storing an encoded advertising set. */
static uint8_t                          m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];  /**< Buffer for storing an encoded scan data. */
static ble_gap_adv_data_t               m_adv_data = {                                            /**< Struct that contains pointers to the encoded advertising data. */
                                                             .adv_data =
                                                         {
                                                             .p_data = m_enc_advdata,
                                                             .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
                                                         },
                                                         .scan_rsp_data =
                                                         {
                                                             .p_data = m_enc_scan_response_data,
                                                             .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
                                                         }
                                                     };                                              
static nrf_ppi_channel_t                ble_led_timer_to_ble_led;                                 /**< PPI channel linking BLE LED timer to the BLE LED */
static nrf_ppi_channel_t                dcc_data_to_main_dcc;                                     /**< PPI channel linking DCC data timer to the main DCC output */
static nrf_ppi_channel_t                dcc_data_to_prog_dcc;                                     /**< PPI channel linking DCC data timer to the programming DCC output */
static nrf_ppi_channel_t                dcc_continuous_ones_to_main_dcc;                          /**< PPI channel linking DCC continuous ones timer to the main DCC output */
static nrf_ppi_channel_t                dcc_continuous_ones_to_prog_dcc;                          /**< PPI channel linking DCC continuous ones timer to the programming DCC output */
static nrf_drv_gpiote_pin_t             output_pin[N_OUTPUTS] = {RELAY_1_PIN_NO,                  /**< Pin Number storage for the relay outputs */
                                                                 RELAY_2_PIN_NO,
                                                                 RELAY_3_PIN_NO,
                                                                 RELAY_4_PIN_NO,
                                                                 RELAY_5_PIN_NO,
                                                                 RELAY_6_PIN_NO,
                                                                 RELAY_7_PIN_NO,
                                                                 RELAY_8_PIN_NO,
                                                                 RELAY_9_PIN_NO,
                                                                 RELAY_10_PIN_NO,
                                                                 RELAY_11_PIN_NO,
                                                                 RELAY_12_PIN_NO,
                                                                 RELAY_13_PIN_NO,
                                                                 RELAY_14_PIN_NO,
                                                                 RELAY_15_PIN_NO};
static bool                             output_flags[N_OUTPUTS];                                  /**< Flags for requesting relay activation */
static dcc_command_t                    dcc_command_buffer[DCC_COMMAND_BUFFER_SIZE];              /**< DCC command buffer that stores pending commands */
static uint8_t                          producer_index;                                           /**< Index of the next available DCC command buffer slot that can be filled */
static uint8_t                          consumer_index;                                           /**< Index of the DCC command buffer slot currently being transmitted */
static bool                             phase1_complete;                                          /**< Flag to control phases of DCC command */
static bool                             phase2_complete;                                          /**< Flag to control phases of DCC command */
static bool                             dcc_disabled;                                             /**< Flag to indicate whether DCC has been disabled completely */
static bool                             adc_baseline_flag;                                        /**< Flag to indicate to the ADC it should store its result as a baseline */
static nrf_saadc_value_t                adc_baseline;                                             /**< Baseline of current feedback measurement */
static bool                             feedback_window_end;                                      /**< Flag to indicate that the feedback window should end */
static bool                             feedback_in_progress;                                     /**< Flag to indicate whether we are monitoring for feedback */
static bool                             acknowledge;                                              /**< Flag to indicate an acknowledge was received during feedback */
static bool                             service_command_pending;                                  /**< Flag to indicate whether a service command is pending */
static bool                             service_command_in_progress;                              /**< Flag to indicate whether a service command is in progress */
static uint8_t                          programming_track_mode;                                   /**< Variable to keep track of programming track mode, this is the mode requested by the characteristic */
static uint8_t                          programming_track_state;                                  /**< Variable to keep track of programming track state */
static uint8_t                          function;                                                 /**< Function of the service command pending/in progress */
static uint8_t                          mode;                                                     /**< Mode of the service command pending/in progress */
static uint8_t                          CV_or_reg_upper;                                          /**< Upper portion of CV or register of the service command pending/in progress */
static uint8_t                          CV_or_reg_lower;                                          /**< Lower portion of CV or register of the service command pending/in progress */
static uint8_t                          service_command_value;                                                    /**< Value to be written of the service command pending/in progress */
static uint16_t                         read_byte_counter;                                        /**< Read byte counter of the service command pending/in progress */
static uint8_t                          read_bit_counter;                                         /**< Read bit counter of the service command pending/in progress */
static uint8_t                          read_bit_value;                                           /**< Read bit response of the service command pending/in progress */
static dcc_command_t                    idle_packet;                                              /**< Memory reserved to transmit idle packets */
static uint32_t                         active_speed_command_index;                               /**< Current place in the speed command array */
static dcc_command_t                    speed_command_array_temp[SPEED_COMMAND_ARRAY_SIZE];       /**< Array for sending periodic speed commands */
static dcc_command_t                    speed_command_array[SPEED_COMMAND_ARRAY_SIZE];            /**< Array for storing periodic speed commands */
static uint8_t                          speed_command_address_type[SPEED_COMMAND_ARRAY_SIZE];     /**< Array for keeping track of the address type the corresponding periodic speed command applies to */
static uint16_t                         speed_command_address[SPEED_COMMAND_ARRAY_SIZE];          /**< Array for keeping track of the address the corresponding periodic speed command applies to */
static dcc_command_t *                  active_packet;                                            /**< Tracks the active packet across DCC data timer handler calls */
static bool                             dcc_packet;                                               /**< Tracks whether the active packet is from dcc_command_buffer across DCC data timer handler calls */

/**@brief Function for removing all periodic speed commands
 */
static void remove_all_speed_commands (void)
{
    uint32_t i;
    for (i = 0; i < SPEED_COMMAND_ARRAY_SIZE; i++)
    {
        speed_command_array[i].occupied = false;
        speed_command_array_temp[i].occupied = false;
        speed_command_address_type[i] = ADDRESS_TYPE_INVALID;
    }
}


/**@brief Function for disabling the DCC output.
 *
 * @details This function is called whenever the DCC output needs to be halted immediately (for example, in error condition). 
 * DCC output disabling is only resettable by complete system reset. 
 */
static void disable_DCC (uint8_t error_code)
{
    uint32_t err_code;
    
    NRF_LOG_INFO("DCC Disabled, code: %d", error_code);

    // Raise flag
    dcc_disabled = true;

    // Turn on brake
    nrf_drv_gpiote_out_clear(BRAKE_N_PIN_NO);

