tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
    scheduled_dcc_command_t scheduled_dcc_command;
    uint32_t err_code;
    
    // Only schedule the enqueue of the command if we have no service command pending or in progress
    if (!service_command_pending && !service_command_in_progress)
    {
        scheduled_dcc_command.byte1 = byte1;
        scheduled_dcc_command.byte2 = byte2;
        scheduled_dcc_command.byte3 = byte3;
        scheduled_dcc_command.byte4 = byte4;
        scheduled_dcc_command.byte5 = byte5;
        scheduled_dcc_command.len = len;
        scheduled_dcc_command.feedback = 0;
        
        err_code = app_sched_event_put(&scheduled_dcc_command, sizeof(scheduled_dcc_command_t), enqueue_dcc_command_from_scheduler);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a write to the Programming Track Select characteristic.
 *
 * @details This function enters programming mode if select is true by enabling the programming track output and indicating via LED.
 *          We do not check for 250mA current sustained for 100ms, which is optional (should) in S-9.2.3.
 *
 * @param[in]   p_bluetrack    BlueTrack service structure.
 * @param[in]   select         Flag to indicate whether the programming track should be selected.
 */
static void programming_track_select_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t select)
{
    NRF_LOG_INFO("Programming Track Select Written, value: %d", select);

    uint32_t err_code;
    
    if (select == MAIN)
    {
        programming_track_mode = MAIN;

        // Indicate programming track deselection
        nrf_drv_gpiote_out_clear(PROG_LED_PIN_NO);
    }
    else
    {
        programming_track_mode = PROGRAMMING;

        // Indicate programming track selection
        nrf_drv_gpiote_out_set(PROG_LED_PIN_NO);
    }

    // Notify the client
    err_code = ble_bluetrack_programming_track_select_update(m_conn_handle, &m_bluetrack);
    if (err_code != BLE_ERROR_INVALID_CONN_HANDLE && err_code != NRF_ERROR_INVALID_STATE && err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    {
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a write to the Stop characteristic.
 *
 * @details This function halts DCC output if select is true by disabling the DCC pin, turning on the brake, and indicating via LED. It starts it again by reversing these conditions, 
 * only if the DCC output has not already been disabled.
 *
 * @param[in]   p_bluetrack    BlueTrack service structure.
 * @param[in]   select         Flag to indicate whether DCC output should be stopped.
 */
static void stop_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t stop)
{
    NRF_LOG_INFO("Stop Written, value: %d", stop);

    uint32_t err_code;

    // First clear all periodic speed commands
    remove_all_speed_commands();
 
    if (stop)
    {
        // Turn on brake
        nrf_drv_gpiote_out_clear(BRAKE_N_PIN_NO);

        // Indicate on LED
        nrf_drv_gpiote_out_set(STOP_LED_PIN_NO);
    }
    else if (!stop)
    {
        // Indicate on LED
        nrf_drv_gpiote_out_clear(STOP_LED_PIN_NO);

        // Only start DCC output if disabled flag is not set
        if (!dcc_disabled)
        {
            // Release the brake
            nrf_drv_gpiote_out_set(BRAKE_N_PIN_NO);
        }
    }

    // Notify the client
    err_code = ble_bluetrack_stop_update(m_conn_handle, &m_bluetrack);
    if (err_code != BLE_ERROR_INVALID_CONN_HANDLE && err_code != NRF_ERROR_INVALID_STATE && err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    {
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a write to the Service Command characteristic.
 *
 * @details This function sets up global variables to precipitate a series of service command sequences.
 *
 * @param[in]   p_bluetrack            BlueTrack service structure.
 * @param[in]   function_local         Indicates whether this is a read_bit, read_byte, write_bit, or write_byte series.
 * @param[in]   mode_local             Indicates whether the access mode is direct, paged, register, or address.
 * @param[in]   CV_or_reg_upper_local  The upper portion of the CV or register address to be accessed.
 * @param[in]   CV_or_reg_lower_local  The lower portion of the CV or register address to be accessed.
 * @param[in]   value_local            The value to be written to the CV or register address if write_byte series.
 */
static void service_command_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t function_local, uint8_t mode_local, uint8_t CV_or_reg_upper_local, uint8_t CV_or_reg_lower_local, uint8_t value_local)
{
    NRF_LOG_INFO("Service Command Written, function_local = %d, mode_local = %d, CV_or_reg_upper_local = %d, CV_or_reg_lower_local = %d, value_local = %d", function_local, mode_local, CV_or_reg_upper_local, CV_or_reg_lower_local, value_local);

    if (!service_command_pending && !service_command_in_progress)
    {
        // Initialise counters and values
        read_byte_counter = 0;
        read_bit_counter = 0;
        read_bit_value = 0;
        
        // Store command parameters
        function = function_local;
        mode = mode_local;
        CV_or_reg_upper = CV_or_reg_upper_local;
        CV_or_reg_lower = CV_or_reg_lower_local;
        service_command_value = value_local;
        
        // Raise pending flag only if parameters are valid
        if ((function == FUNCTION_READ_BIT || function == FUNCTION_READ_BYTE || function == FUNCTION_WRITE_BIT || function == FUNCTION_WRITE_BYTE) &&
            (mode == MODE_DIRECT || mode == MODE_ADDRESS || mode == MODE_PAGED || mode == MODE_REGISTER) &&
            ((function != FUNCTION_READ_BIT && function != FUNCTION_WRITE_BIT) || ((function == FUNCTION_READ_BIT || function == FUNCTION_WRITE_BIT) && (mode == MODE_DIRECT))))
        {
            NRF_LOG_INFO("service_command_pending Raised");
            service_command_pending = true;
        }
    }
}


/**@brief Function for executing a service command.
 *
 * @details This function places a series of DCC commands in the buffer corresponding to the service command requested, as
 * indicated by the relevant global variables. Every service command sequence must have a feedback request.
 *
 * @param[in]   p_event_data   Undefined pointer.
 * @param[in]   event_size     Size of 0.
 */
void execute_service_command (void *p_event_data, uint16_t event_size)
{
    uint8_t byte1;
    uint8_t byte2;
    uint8_t byte3;

    uint8_t i;

