tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
    uint8_t page;
    uint8_t data_register;
    
    uint16_t CV_or_reg = ( ((uint16_t)CV_or_reg_lower) | 
                 ( ((uint16_t)CV_or_reg_upper) << 8 ) );
    if (event_size == 0)
    {
        // As per S-9.2.3, we should guarantee a power on cycle by queueing 20 idle packets
        for (i = 0; i < 20; i++)
        {
            enqueue_dcc_command(0xFF, 0, 0, 0, 0, 2, 0, NULL);
        }
        
        if (function == FUNCTION_WRITE_BYTE)
        {
            if (mode == MODE_DIRECT)
            {
                // TOTAL 14
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // We are sending a CV address, so only extract the lower two bits from the upper byte
                byte1 = 0x7C | (CV_or_reg_upper & 0x03);
                byte2 = CV_or_reg_lower;
                byte3 = service_command_value;
                
                // 5 write packets
                enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 0, NULL);
                }
                
                // 6 reset packets
                for (i = 0; i < 6; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
            }
            else if (mode == MODE_ADDRESS)
            {
                // TOTAL 32
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 5 page preset packets
                for (i = 0; i < 5; i++)
                {
                    enqueue_dcc_command(0x7D, 0x01, 0, 0, 0, 2, 0, NULL);
                }
                
                // 6 reset packets
                for (i = 0; i < 6; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                byte1 = 0x78;
                // Ensure the address to be written is <= 127 (S-9.2.2 CV 1)
                byte2 = service_command_value & 0x7F;
                
                // 5 write packets
                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
                }
                
                // 10 reset packets
                for (i = 0; i < 10; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
            }
            else if (mode == MODE_REGISTER)
            {
                // TOTAL 32
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 5 page preset packets
                for (i = 0; i < 5; i++)
                {
                    enqueue_dcc_command(0x7D, 0x01, 0, 0, 0, 2, 0, NULL);
                }
                
                // 6 reset packets
                for (i = 0; i < 6; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // For a register address, extract only the lower three bits from the lower byte
                byte1 = 0x78 | (CV_or_reg_lower & 0x07);
                byte2 = service_command_value;
                
                // 5 write packets
                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
                }
                
                // 10 reset packets
                for (i = 0; i < 10; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
            }
            else if (mode == MODE_PAGED)
            {
                // TOTAL 28
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // Ensure CV is < 1024 before converting to page number
                page = ((CV_or_reg & 0x03FF) / 4) + 1;
                
                // 5 page preset packets
                for (i = 0; i < 5; i++)
                {
                    enqueue_dcc_command(0x7D, page, 0, 0, 0, 2, 0, NULL);
                }
                
                // 6 reset packets
                for (i = 0; i < 6; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // Ensure CV is < 1024 before converting to register number
                data_register = (CV_or_reg & 0x03FF) % 4;
                byte1 = 0x78 | data_register;
                byte2 = service_command_value;
                
                // 5 write packets
                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
                }
                
                // 6 reset packets
                for (i = 0; i < 6; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
            }
        }
        else if (function == FUNCTION_READ_BYTE)
        {
            if (mode == MODE_DIRECT)
            {
                // TOTAL 9
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // We are sending a CV address, so only extract the lower two bits from the upper byte
                byte1 = 0x74 | (CV_or_reg_upper & 0x03);
                byte2 = CV_or_reg_lower;
                byte3 = read_byte_counter;
                
                // 5 read packets
                enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 0, NULL);
                }
                
