tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
                // 1 reset packet
                enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
            }
            else if (mode == MODE_ADDRESS)
            {
                // TOTAL 21
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 5 page preset packets
                for (i = 0; i < 5; i++)
                {
                    enqueue_dcc_command(0x7D, 0x01, 0, 0, 0, 2, 0, NULL);
                }
                
                // 5 reset packets
                for (i = 0; i < 5; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                byte1 = 0x70;
                // Ensure the address to be written is <= 127
                byte2 = read_byte_counter & 0x7F;
                
                // 5 read packets
                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
                }
            }
            else if (mode == MODE_REGISTER)
            {
                // TOTAL 24
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 5 page preset packets
                for (i = 0; i < 5; i++)
                {
                    enqueue_dcc_command(0x7D, 0x01, 0, 0, 0, 2, 0, NULL);
                }
                
                // 6 reset packets
                for (i = 0; i < 6; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // For a register address, extract only the lower three bits from the lower byte
                byte1 = 0x70 | (CV_or_reg_lower & 0x07);
                byte2 = read_byte_counter;
                
                // 7 read packets
                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
                for (i = 0; i < 7; i++)
                {
                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
                }
            }
            else if (mode == MODE_PAGED)
            {
                // TOTAL 22
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // Ensure CV is < 1024 before converting to page number
                page = ((CV_or_reg & 0x03FF) / 4) + 1;
                
                // 5 page preset packets
                for (i = 0; i < 5; i++)
                {
                    enqueue_dcc_command(0x7D, page, 0, 0, 0, 2, 0, NULL);
                }
                
                // 6 reset packets
                for (i = 0; i < 6; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // Ensure CV is < 1024 before converting to register number
                data_register = (CV_or_reg & 0x03FF) % 4;
                byte1 = 0x70 | data_register;
                byte2 = service_command_value;
                
                // 5 read packets
                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
                }
            }
        }
        else if (function == FUNCTION_WRITE_BIT)
        {
            if (mode == MODE_DIRECT)
            {
                // TOTAL 14
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // We are sending a CV address, so only extract the lower two bits from the upper byte
                byte1 = 0x78 | (CV_or_reg_upper & 0x03);
                byte2 = CV_or_reg_lower;
                // The lower 4 bits of value are the bit value to be written (bit 3) and the bit position (bits 2-0)
                byte3 = 0xF0 | (service_command_value & 0x0F);
                
                // 5 write packets
                enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 0, NULL);
                }
                
                // 6 reset packets
                for (i = 0; i < 6; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
            }
        }
        else if (function == FUNCTION_READ_BIT)
        {
            if (mode == MODE_DIRECT)
            {
                // TOTAL 9
                // 3 reset packets
                for (i = 0; i < 3; i++)
                {
                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
                }
                
                // We are sending a CV address, so only extract the lower two bits from the upper byte
                byte1 = 0x78 | (CV_or_reg_upper & 0x03);
                byte2 = CV_or_reg_lower;
                // read_bit_counter is the bit position
                byte3 = 0xE8 | (read_bit_counter & 0x07);
                
                // 5 read packets
                enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 1, NULL);
                for (i = 0; i < 4; i++)
                {
                    enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 0, NULL);
                }
                
