tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
                // 1 reset packet
                enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
            }
        }
    }
    else
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_LENGTH);
    }
}


/**@brief Function for handling the THERMAL_N signal going high to low.
 *
 * @details This indicates overtemperature, therefore disable DCC.
 */
void thermal_n_hi_to_lo_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    NRF_LOG_INFO("THERMAL_N signal went high to low");
    // Disable DCC
    disable_DCC(ERROR_CODE_OVERTEMPERATURE);
}


/**@brief Dummy function for handling timer events.
 *
 * @details This handler does nothing.
 */
void dummy_timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{
      NRF_LOG_INFO("Dummy timer event triggered");
}


/**@brief Dummy function for handling saadc events.
 *
 * @details This handler does nothing.
 */
void dummy_saadc_event_handler(nrfx_saadc_evt_t const *p_event)
{
      NRF_LOG_INFO("Dummy saadc event triggered");
}


/**@brief Function for handling the DCC_DATA timer event.
 *
 * @details This handler drives the DCC output logic. Based on the phase flags, and the state of the buffer, appropriate values are loaded into DCC_DATA CC
 * register correponding to durations of DCC 1s and 0s. A sync output is triggered at the start of each packet. If required, feedback is collected.
 */
void timer_dcc_data_event_handler(nrf_timer_event_t event_type, void* p_context)
{
    uint32_t err_code;
    bool dcc_output_state;
    static uint32_t counter = 0;
    uint32_t i;

    if (phase1_complete)
    {
        // We have ended phase 1, timer value remains the same for phase 2
        phase1_complete = false;
        phase2_complete = true;
    }
    else if (phase2_complete)
    {
        // We have ended phase 2, timer value update may be required
        if (active_packet == NULL)
        {
            // We need to draw a new packet from the buffers
            if (dcc_command_buffer[consumer_index].occupied && !(programming_track_state == MAIN_REPEAT))
            {
                active_packet = &dcc_command_buffer[consumer_index];
                dcc_packet = true;
            }
            else if (speed_command_array_temp[active_speed_command_index].occupied && !(programming_track_state == PROGRAMMING))
            {
                active_packet = &speed_command_array_temp[active_speed_command_index];
            }
            else if (idle_packet.occupied && !(programming_track_state == MAIN_REPEAT))
            {
                active_packet = &idle_packet;
            }
        }
        
        if (active_packet)
        {
            // Clear the sync output, only if there is no feedback in progress (it will be cleared when the feedback window ends)
            if (!feedback_in_progress)
            {
                nrf_drv_gpiote_out_clear(SYNC_PIN_NO);
            }
            // Enable sync output if this is the first bit of this packet
            if (active_packet->sync)
            {
                nrf_drv_gpiote_out_set(SYNC_PIN_NO);
                active_packet->sync = false;
            }

            // Only start feedback if feedback is not in progress, we are sending a dcc packet, and a service command is in progress
            if (active_packet->feedback && !feedback_in_progress && dcc_packet && service_command_in_progress)
            {
                NRF_LOG_INFO("Feedback requested");
                // Set variables
                feedback_in_progress = true;
                adc_baseline_flag = true;
                feedback_window_end = false;
                acknowledge = false;
                // Indicate on sync pin that a feedback window is in progress
                nrf_drv_gpiote_out_set(SYNC_PIN_NO);
            }
            // Clear feedback flag, we do not want to check it again for this packet
            active_packet->feedback = false;

            // Determine data for transmission
            if (active_packet->data0_count > 0)
            {
                dcc_output_state = BIT_31 & active_packet->data0;
                active_packet->data0 = (active_packet->data0 << 1);
                active_packet->data0_count = active_packet->data0_count - 1;
            }
            else if (active_packet->data1_count > 0)
            {
                dcc_output_state = BIT_31 & active_packet->data1;
                active_packet->data1 = (active_packet->data1 << 1);
                active_packet->data1_count = active_packet->data1_count - 1;
            }
            else if (active_packet->data2_count > 0)
            {
                dcc_output_state = BIT_31 & active_packet->data2;
                active_packet->data2 = (active_packet->data2 << 1);
                active_packet->data2_count = active_packet->data2_count - 1;
            }
            else
            {
                APP_ERROR_CHECK(NRF_ERROR_INVALID_FLAGS);
            }
            // Send data
            phase1_complete = true;
            phase2_complete = false;
            nrf_timer_cc_write(TIMER_DCC_DATA.p_reg, NRF_TIMER_CC_CHANNEL0, dcc_output_state ? nrf_drv_timer_us_to_ticks(&TIMER_DCC_DATA, DCC_ONE_TIME_US) : nrf_drv_timer_us_to_ticks(&TIMER_DCC_DATA, DCC_ZERO_TIME_US));

            // Check for exhaustion and unset occupied
            if (active_packet->data2_count == 0)
            {
                active_packet->occupied = false;
                active_packet = NULL;
                if (dcc_packet)
                {
                    dcc_packet = false;
                    // If it was a DCC packet, update global variables
                    consumer_index = consumer_index + 1;
                    // Reset consumer index if we have overflowed
                    if (consumer_index == DCC_COMMAND_BUFFER_SIZE)
                    {
                        consumer_index = 0;
                    }
                    
                    // If we were in a service command and the buffer is empty, indicate to the feedback timer that the buffer is empty and the service command is complete.
                    // Running the feedback timer through all the packets queued by the service command ensures we continue to look for basic acknowledgement pulses through the decoder recovery time (S-9.2.3)
                    // It is enforced that all service commands include a feedback command at some point, and feedback is only started for dcc_packets during a service command, so it is safe that the feedback timer is the only thing that can turn service_command_in_progress off
                    // Idle packets and speed command packets can never request feedback, enforced above
                    if (!dcc_command_buffer[consumer_index].occupied && service_command_in_progress)
                    {
                        NRF_LOG_INFO("Ending feedback window");
                        feedback_window_end = true;
                    }
                }
            }
        }
        else
        {
            // There is nothing to send in any of the packet sources
#ifdef DEBUG
            NRF_LOG_INFO("All buffers empty, counter: %d", counter);
#endif
            counter = counter + 1;

            // We're guaranteed to have an empty buffer, so execute a service command, if one is pending
            if (service_command_pending) {
                service_command_in_progress = true;
                service_command_pending = false;
                err_code = app_sched_event_put(NULL, 0, execute_service_command);
                APP_ERROR_CHECK(err_code);
                NRF_LOG_INFO("Executing service command");
            }
            
            // There was no valid speed command packet at the current index (or we were inhibited from sending it), so update the temporary array for that index, increment (to avoid fixating on a single valid entry) and identify the next valid one

