tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
            // Copy the speed command back over, making sure to set occupied last (a process removing a speed command will set occupied false first)
            speed_command_array_temp[active_speed_command_index].data0 = speed_command_array[active_speed_command_index].data0;
            speed_command_array_temp[active_speed_command_index].data0_count = speed_command_array[active_speed_command_index].data0_count;
            speed_command_array_temp[active_speed_command_index].data1 = speed_command_array[active_speed_command_index].data1;
            speed_command_array_temp[active_speed_command_index].data1_count = speed_command_array[active_speed_command_index].data1_count;
            speed_command_array_temp[active_speed_command_index].data2 = speed_command_array[active_speed_command_index].data2;
            speed_command_array_temp[active_speed_command_index].data2_count = speed_command_array[active_speed_command_index].data2_count;
            
            speed_command_array_temp[active_speed_command_index].sync = speed_command_array[active_speed_command_index].sync;
            speed_command_array_temp[active_speed_command_index].feedback = speed_command_array[active_speed_command_index].feedback;
            speed_command_array_temp[active_speed_command_index].occupied = speed_command_array[active_speed_command_index].occupied;
            
            // Increment the active speed command index so we don't repeat the command over and over
            active_speed_command_index = active_speed_command_index + 1;
            // Reset active speed command index if we have overflowed
            if (active_speed_command_index == SPEED_COMMAND_ARRAY_SIZE)
            {
                active_speed_command_index = 0;
            }
            
            // Now go through the array once to find the next valid packet
            for (i = 0; i < SPEED_COMMAND_ARRAY_SIZE; i++)
            {
                if (speed_command_array_temp[active_speed_command_index].occupied)
                {
                    // We've found a valid packet
                    break;
                }
                else
                {
                    active_speed_command_index = active_speed_command_index + 1;
                    // Reset active speed command index if we have overflowed
                    if (active_speed_command_index == SPEED_COMMAND_ARRAY_SIZE)
                    {
                        active_speed_command_index = 0;
                    }
                }
            }
            
            // The idle packet needs refreshing (or we were inhibited from sending it)
            idle_packet.data0 = 0xFFFFF000 | (0xFF << 3);
            idle_packet.data0_count = 30;
            idle_packet.data1 = 0x00004000 | (0x00 << 24) | ((0xFF ^ 0x00) << 15);
            idle_packet.data1_count = 18;
            idle_packet.data2 = 0x80000000;
            idle_packet.data2_count = 1;
            
            idle_packet.sync = false;
            idle_packet.feedback = false;
            idle_packet.occupied = true;
            
            // Now update the programming state
            if ((programming_track_mode == MAIN) && !(programming_track_state == MAIN))
            {
                // We only need to change the output if we are programming state
                if (programming_track_state == PROGRAMMING)
                {
                    // Disable channels
                    err_code = nrf_drv_ppi_channel_disable(dcc_data_to_prog_dcc);
                    APP_ERROR_CHECK(err_code);
                    err_code = nrf_drv_ppi_channel_disable(dcc_continuous_ones_to_main_dcc);
                    APP_ERROR_CHECK(err_code);
                    
                    // Enable channels
                    err_code = nrf_drv_ppi_channel_enable(dcc_data_to_main_dcc);
                    APP_ERROR_CHECK(err_code);
                    err_code = nrf_drv_ppi_channel_enable(dcc_continuous_ones_to_prog_dcc);
                    APP_ERROR_CHECK(err_code);
                }
                programming_track_state = MAIN;
                NRF_LOG_INFO("Switched programming state to MAIN");
            }
            else if (programming_track_mode == PROGRAMMING)
            {
                if (programming_track_state == PROGRAMMING)
                {
                    // Disable channels
                    err_code = nrf_drv_ppi_channel_disable(dcc_data_to_prog_dcc);
                    APP_ERROR_CHECK(err_code);
                    err_code = nrf_drv_ppi_channel_disable(dcc_continuous_ones_to_main_dcc);
                    APP_ERROR_CHECK(err_code);
                    
                    // Enable channels
                    err_code = nrf_drv_ppi_channel_enable(dcc_data_to_main_dcc);
                    APP_ERROR_CHECK(err_code);
                    err_code = nrf_drv_ppi_channel_enable(dcc_continuous_ones_to_prog_dcc);
                    APP_ERROR_CHECK(err_code);

                    programming_track_state = MAIN_REPEAT;
                    NRF_LOG_INFO("Switched programming state to MAIN_REPEAT");
                }
                else
                {
                    // Disable channels
                    err_code = nrf_drv_ppi_channel_disable(dcc_data_to_main_dcc);
                    APP_ERROR_CHECK(err_code);
                    err_code = nrf_drv_ppi_channel_disable(dcc_continuous_ones_to_prog_dcc);
                    APP_ERROR_CHECK(err_code);
                    
                    // Enable channels
                    err_code = nrf_drv_ppi_channel_enable(dcc_data_to_prog_dcc);
                    APP_ERROR_CHECK(err_code);
                    err_code = nrf_drv_ppi_channel_enable(dcc_continuous_ones_to_main_dcc);
                    APP_ERROR_CHECK(err_code);

                    programming_track_state = PROGRAMMING;
                    NRF_LOG_INFO("Switched programming state to PROGRAMMING");
                }
            }

            // Send a single one, as we have no data to send this time
            phase1_complete = true;
            phase2_complete = false;
            nrf_timer_cc_write(TIMER_DCC_DATA.p_reg, NRF_TIMER_CC_CHANNEL0, nrf_drv_timer_us_to_ticks(&TIMER_DCC_DATA, DCC_ONE_TIME_US));
        }
    }
    else
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_FLAGS);
    }
}


