tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/**@brief Function for handling the feedback application timer expiry.
 *
 * @details Feedback application timer runs continuously. Every time it fires the ADC is sampled and compared to limits. The sample is 
 * only processed in a feedback window. Depending on the state of the application flags, this result is either stored as the
 * baseline of a feedback collection, or compared to the baseline to determine whether the acknowledge flag should be raised.
 * The feedback window is terminated if necessary, in this case the service command is continued or terminated. 
 */
static void feedback_timer_timeout_handler(void *p_context)
{
    ret_code_t        err_code;
    nrf_saadc_value_t main_value;
    nrf_saadc_value_t prog_value;
    nrf_saadc_value_t value;

    err_code = nrf_drv_saadc_sample_convert(MAIN_I_SENSE_CHANNEL, &main_value);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_sample_convert(PROG_I_SENSE_CHANNEL, &prog_value);
    APP_ERROR_CHECK(err_code);

#ifdef DEBUG
    NRF_LOG_INFO("Main value: %d, Prog value: %d", main_value, prog_value);
#endif


    if ((main_value >= ADC_LIMIT) && (prog_value >= ADC_LIMIT))
    {
        NRF_LOG_INFO("Main and programming overcurrent error");
        // Disable DCC
        disable_DCC(ERROR_CODE_MAIN_AND_PROG_OVERCURRENT);
    }
    else if (main_value >= ADC_LIMIT)
    {
        NRF_LOG_INFO("Main overcurrent error");
        // Disable DCC
        disable_DCC(ERROR_CODE_MAIN_OVERCURRENT);
    }
    else if (prog_value >= ADC_LIMIT)
    {
        NRF_LOG_INFO("Programming overcurrent error");
        // Disable DCC
        disable_DCC(ERROR_CODE_PROG_OVERCURRENT);
    }
    else if ((main_value + prog_value) >= ADC_LIMIT)
    {
        NRF_LOG_INFO("Sum of main and programming overcurrent error");
        // Disable DCC
        disable_DCC(ERROR_CODE_SUM_MAIN_AND_PROG_OVERCURRENT);
    }

    if (feedback_in_progress)
    {
        // Conclude the feedback window if it has ended
        if (feedback_window_end)
        {
            // Buffer is empty in service mode
            if (function == FUNCTION_WRITE_BYTE || function == FUNCTION_WRITE_BIT)
            {
                // We are done now, transmit back result
                err_code = ble_bluetrack_response_update(m_conn_handle, &m_bluetrack, acknowledge ? 0x01 : 0x00, service_command_value);
                if (err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                    err_code != NRF_ERROR_INVALID_STATE && 
                    err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
                {
                    APP_ERROR_CHECK(err_code);
                }
                NRF_LOG_INFO("Write byte/write bit of value %d complete, acknowledge = %d", service_command_value, acknowledge);
                service_command_in_progress = false;
            }
            else if (function == FUNCTION_READ_BYTE)
            {
                // Last condition is special case to avoid repeating the read byte values for an address mode read
                if (acknowledge || (read_byte_counter >= READ_BYTE_COUNTER_MAX) || (mode == MODE_ADDRESS && read_byte_counter >= READ_BIT_COUNTER_MAX_ADDRESS))
                {
                    // We have either received a positive response, or we've exhausted all values, transmit back result
                    err_code = ble_bluetrack_response_update(m_conn_handle, &m_bluetrack, acknowledge ? 0x01 : 0x00, read_byte_counter);
                    if (err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                        err_code != NRF_ERROR_INVALID_STATE &&
                        err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                    NRF_LOG_INFO("Read byte complete, acknowledge = %d, value = %d", acknowledge, read_byte_counter);
                    service_command_in_progress = false;
                }
                else
                {
                    // No response received, continue to try new values
                    NRF_LOG_INFO("Read byte check value %d failed, now trying next value", read_byte_counter);
                    read_byte_counter = read_byte_counter + 1;
                    err_code = app_sched_event_put(NULL, 0, execute_service_command);
                    APP_ERROR_CHECK(err_code);
                }
            }
            else if (function == FUNCTION_READ_BIT)
            {
                read_bit_value = read_bit_value | ((acknowledge ? 1 : 0) << read_bit_counter);
                if (read_bit_counter >= READ_BIT_COUNTER_MAX)
                {
                    // We have finished asking for the value of all bit positions, transmit back result
                    err_code = ble_bluetrack_response_update(m_conn_handle, &m_bluetrack, 0x01, read_bit_value);
                    if (err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                        err_code != NRF_ERROR_INVALID_STATE &&
                        err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                    NRF_LOG_INFO("Read bits complete, value = %d", read_bit_value);
                    service_command_in_progress = false;
                }
                else
                {
                    // Ask for next bit position
                    NRF_LOG_INFO("Read bit %d as %d", read_bit_counter, acknowledge);
                    read_bit_counter = read_bit_counter + 1;
                    err_code = app_sched_event_put(NULL, 0, execute_service_command);
                    APP_ERROR_CHECK(err_code);
                }
            }
            // Lower feedback flag
            feedback_in_progress = false;
            // Clear sync output
            nrf_drv_gpiote_out_clear(SYNC_PIN_NO);
        }
        else
        {
            if (programming_track_state == MAIN)
            {
                value = main_value;
                NRF_LOG_INFO("Feedback in progress, main value: %d", main_value);
            }
            else if (programming_track_state == PROGRAMMING)
            {
                value = prog_value;
                NRF_LOG_INFO("Feedback in progress, prog value: %d", prog_value);
            }
            else
            {
                // We don't expect to be in MAIN_REPEAT, as feedback can't be started unless we have a DCC packet
                APP_ERROR_CHECK(NRF_ERROR_INVALID_FLAGS);
            }

