tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
            // Record or compare to baseline
            if (adc_baseline_flag)
            {
                adc_baseline = value;
                adc_baseline_flag = false;
                NRF_LOG_INFO("ADC result stored as baseline");
            }
            else
            {
                // Set acknowledge if the result was the required amount above the baseline
                if (value > (adc_baseline + ADC_DELTA))
                {
                    acknowledge = true;
                    NRF_LOG_INFO("ADC result %d higher than baseline %d + delta %d", value, adc_baseline, ADC_DELTA);
                }
            }
        }
    }

    // Start the timer
    err_code = app_timer_start(feedback_timer, APP_TIMER_TICKS(ADC_SAMPLE_INTERVAL_MS), NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the output application timer expiry.
 *
 * @details Output application timer runs continuously. Every time it completes, it checks if it needs to actuate a relay output by looking at the flags. It passes the value of
 * the relay output to itself so it can clear it on expiry. Flags are searched independent of raise order. Only one relay is ever actuated at a time to protect the power supply.
 */
static void output_timer_timeout_handler(void *p_context)
{
    nrf_drv_gpiote_pin_t * p_pin_to_clear = (nrf_drv_gpiote_pin_t*)p_context;
    uint32_t i, err_code;
    bool enqueued_output = false;

    // Turn off output if one was actuated
    if (p_pin_to_clear != NULL)
    {
        NRF_LOG_INFO("Turning off pin %d", *p_pin_to_clear);
        nrf_drv_gpiote_out_clear(*p_pin_to_clear);
    }

    // Look for an enqueued output and start timer if we find one
    for (i = 0; i < (N_OUTPUTS); i++)
    {
        if (output_flags[i])
        {
            NRF_LOG_INFO("Output %d to be actuated", i);

            enqueued_output = true;

            // Lower flag
            output_flags[i] = false;

            // Turn on output
            NRF_LOG_INFO("Turning on pin %d", output_pin[i]);
            nrf_drv_gpiote_out_set(output_pin[i]);

            // Start timer.
            err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL_MS), &(output_pin[i]));
            APP_ERROR_CHECK(err_code);

            // Only one relay is to be actuated at at time to protect the power supply.
            break;
        }
    }

    if (!enqueued_output)
    {
        // Start timer with no output actuation
        err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL_MS), NULL);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for initialising the GPIOTE module.
 */
static void gpiote_init(void)
{
    ret_code_t                  err_code;
    uint32_t                    i;
    nrf_drv_gpiote_in_config_t  config_in =               GPIOTE_CONFIG_IN_SENSE_HITOLO(false);
    nrf_drv_gpiote_out_config_t config_out_toggle_false = GPIOTE_CONFIG_OUT_TASK_TOGGLE(false);   
    nrf_drv_gpiote_out_config_t config_out_simple_false = GPIOTE_CONFIG_OUT_SIMPLE(false);
    nrf_drv_gpiote_out_config_t config_out_simple_true =  GPIOTE_CONFIG_OUT_SIMPLE(true);

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    // Initialise main DCC output - under PPI control
    err_code = nrf_drv_gpiote_out_init(MAIN_DCC_PIN_NO, &config_out_toggle_false);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_out_task_enable(MAIN_DCC_PIN_NO);

    // Initialise brake output (start with brake on) - under CPU control
    err_code = nrf_drv_gpiote_out_init(BRAKE_N_PIN_NO, &config_out_simple_false);
    APP_ERROR_CHECK(err_code);

    // Initialise relay outputs (start not actuated) - under CPU control
    for (i =0; i < (N_OUTPUTS); i++)
    {
        err_code = nrf_drv_gpiote_out_init(output_pin[i], &config_out_simple_false);
        APP_ERROR_CHECK(err_code);
    }

    // Initialise sync output (start with no SYNC indicated) - under CPU control
    err_code = nrf_drv_gpiote_out_init(SYNC_PIN_NO, &config_out_simple_false);
    APP_ERROR_CHECK(err_code);     

    // Initialise stop LED (start stopped) - under CPU control
    err_code = nrf_drv_gpiote_out_init(STOP_LED_PIN_NO, &config_out_simple_true);
    APP_ERROR_CHECK(err_code);   

    // Initialise programming DCC output - under PPI control
    err_code = nrf_drv_gpiote_out_init(PROG_DCC_PIN_NO, &config_out_toggle_false);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_out_task_enable(PROG_DCC_PIN_NO);

    // Initialise thermal input - generates GPIOTE event
    config_in.pull = NRF_GPIO_PIN_PULLUP;
    err_code = nrf_drv_gpiote_in_init(THERMAL_N_PIN_NO, &config_in, thermal_n_hi_to_lo_handler);
    APP_ERROR_CHECK(err_code);

    // Initialise error LED (start with no error) - under CPU control
    err_code = nrf_drv_gpiote_out_init(ERROR_LED_PIN_NO, &config_out_simple_false);
    APP_ERROR_CHECK(err_code);

    // Initialise BLE LED (start off) - under PPI control
    err_code = nrf_drv_gpiote_out_init(BLE_LED_PIN_NO, &config_out_toggle_false);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_out_task_enable(BLE_LED_PIN_NO);

    // Initialise programming LED (start not in programming mode) - under CPU control
    err_code = nrf_drv_gpiote_out_init(PROG_LED_PIN_NO, &config_out_simple_false);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initialising timers.
 *
 * @details Initializes the application timer, as well as TIMER1 and TIMER2.
 */
static void timers_init(void)
{
    ret_code_t             err_code;
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = NRF_TIMER_FREQ_1MHz;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;

    // Initialise DCC_DATA timer (initially outputs 1s)
    err_code = nrf_drv_timer_init(&TIMER_DCC_DATA, &timer_cfg, timer_dcc_data_event_handler);
    APP_ERROR_CHECK(err_code);
    nrf_drv_timer_extended_compare(&TIMER_DCC_DATA, NRF_TIMER_CC_CHANNEL0, nrf_drv_timer_us_to_ticks(&TIMER_DCC_DATA, DCC_ONE_TIME_US), NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    // Implement a constant CC to guard against missing a COMPARE event when we change from ZERO to ONE and the interrupt handler is delayed
    nrf_drv_timer_extended_compare(&TIMER_DCC_DATA, NRF_TIMER_CC_CHANNEL1, nrf_drv_timer_us_to_ticks(&TIMER_DCC_DATA, DCC_ZERO_TIME_US), NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK, false);

    // Initialise BLE_LED timer
    err_code = nrf_drv_timer_init(&TIMER_BLE_LED, &timer_cfg, dummy_timer_event_handler);
    APP_ERROR_CHECK(err_code);
    nrf_drv_timer_extended_compare(&TIMER_BLE_LED, NRF_TIMER_CC_CHANNEL0, nrf_drv_timer_ms_to_ticks(&TIMER_BLE_LED, BLE_LED_TOGGLE_TIME_MS), NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, false);

    // Initialise DCC_CONTINOUS_ONES timer (always outputs 1s)
    err_code = nrf_drv_timer_init(&TIMER_DCC_CONTINOUS_ONES, &timer_cfg, dummy_timer_event_handler);
    APP_ERROR_CHECK(err_code);
    nrf_drv_timer_extended_compare(&TIMER_DCC_CONTINOUS_ONES, NRF_TIMER_CC_CHANNEL0, nrf_drv_timer_us_to_ticks(&TIMER_DCC_CONTINOUS_ONES, DCC_ONE_TIME_US), NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, false);

    // Initialize application timer module
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create output application timer
    err_code = app_timer_create(&output_timer, APP_TIMER_MODE_SINGLE_SHOT, output_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
    // Create feedback application timer
    err_code = app_timer_create(&feedback_timer, APP_TIMER_MODE_SINGLE_SHOT, feedback_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initialising the Programmable Peripheral Interconnect (PPI) module.
 *
 * @details PPI is used for BLE LED, DCC Output, and DCC Programming Output.
 */
static void ppi_init(void)
{
    ret_code_t        err_code;

