tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    // Allocate, assign, and enable BLE LED PPI channel
    err_code = nrf_drv_ppi_channel_alloc(&ble_led_timer_to_ble_led);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_assign(ble_led_timer_to_ble_led, nrf_drv_timer_event_address_get(&TIMER_BLE_LED, NRF_TIMER_EVENT_COMPARE0), nrf_drv_gpiote_out_task_addr_get(BLE_LED_PIN_NO));
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_enable(ble_led_timer_to_ble_led);
    APP_ERROR_CHECK(err_code);

    // Allocate, assign, and enable DCC Output PPI channels (note DCC Data is enabled initially)
    err_code = nrf_drv_ppi_channel_alloc(&dcc_data_to_main_dcc);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_assign(dcc_data_to_main_dcc, nrf_drv_timer_event_address_get(&TIMER_DCC_DATA, NRF_TIMER_EVENT_COMPARE0), nrf_drv_gpiote_out_task_addr_get(MAIN_DCC_PIN_NO));
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_enable(dcc_data_to_main_dcc);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_channel_alloc(&dcc_continuous_ones_to_main_dcc);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_assign(dcc_continuous_ones_to_main_dcc, nrf_drv_timer_event_address_get(&TIMER_DCC_CONTINOUS_ONES, NRF_TIMER_EVENT_COMPARE0), nrf_drv_gpiote_out_task_addr_get(MAIN_DCC_PIN_NO));
    APP_ERROR_CHECK(err_code);

    // Allocate, assign, and enable Programming DCC Output PPI channels (note DCC Continuous Ones is enabled initially)
    err_code = nrf_drv_ppi_channel_alloc(&dcc_continuous_ones_to_prog_dcc);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_assign(dcc_continuous_ones_to_prog_dcc, nrf_drv_timer_event_address_get(&TIMER_DCC_CONTINOUS_ONES, NRF_TIMER_EVENT_COMPARE0), nrf_drv_gpiote_out_task_addr_get(PROG_DCC_PIN_NO));
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_enable(dcc_continuous_ones_to_prog_dcc);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_channel_alloc(&dcc_data_to_prog_dcc);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_assign(dcc_data_to_prog_dcc, nrf_drv_timer_event_address_get(&TIMER_DCC_DATA, NRF_TIMER_EVENT_COMPARE0), nrf_drv_gpiote_out_task_addr_get(PROG_DCC_PIN_NO));
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the ADC module.
*/
static void adc_init(void)
{
    ret_code_t                 err_code;
    nrf_saadc_channel_config_t channel_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(MAIN_I_SENSE_INPUT);
    nrf_saadc_value_t          value;
    channel_config.gain = NRF_SAADC_GAIN1_3;

    err_code = nrf_drv_saadc_init(NULL, dummy_saadc_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(MAIN_I_SENSE_CHANNEL, &channel_config);
    APP_ERROR_CHECK(err_code);
    
    channel_config.pin_p = PROG_I_SENSE_INPUT;
    err_code = nrf_drv_saadc_channel_init(PROG_I_SENSE_CHANNEL, &channel_config);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for initializing BlueTrack data structures.
 */
static void bluetrack_init(void)
{
    uint32_t i;

    // Populate index array and initialise flags
    for(i = 0; i < (N_OUTPUTS); i++)
    {
        output_flags[i] = false;
    }

    // Start with no active packet
    active_packet = NULL;
    dcc_packet = false;

    // Clear buffer
    memset(dcc_command_buffer, 0, sizeof(dcc_command_buffer));
    
    // We start with no pending speed commands
    remove_all_speed_commands();
    active_speed_command_index = 0;

    // Clear idle memory
    memset(&idle_packet, 0, sizeof(idle_packet));

    // Set indexes and phases
    producer_index = 0;
    consumer_index = 0;
    phase1_complete = true;
    phase2_complete = false;

    // We start off with DCC enabled
    dcc_disabled = false;

    // We start of with feedback not in progress
    feedback_in_progress = false;

    // We start off with the main track selected
    programming_track_mode = MAIN;
    programming_track_state = MAIN;
    
    // We start off with no service command pending or in progress
    service_command_pending = false;
    service_command_in_progress = false;

    // We do not send 20 reset packets and 10 idle packets, as suggested by S-9.2.4
}


/**@brief Function for starting timers.
*/
static void timers_start(void)
{
    uint32_t err_code;

    nrf_drv_timer_enable(&TIMER_DCC_DATA);
    nrf_drv_timer_enable(&TIMER_BLE_LED);
    nrf_drv_timer_enable(&TIMER_DCC_CONTINOUS_ONES);

    // Start relay timer
    err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL_MS), NULL);
    APP_ERROR_CHECK(err_code);

    // Start feedback timer
    err_code = app_timer_start(feedback_timer, APP_TIMER_TICKS(ADC_SAMPLE_INTERVAL_MS), NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
    ble_gap_addr_t          address;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    ret_code_t               err_code;
    ble_advdata_t            advdata;
    ble_advdata_t            srdata;
    ble_gap_adv_params_t     adv_params;
    ble_advdata_manuf_data_t manuf_data;
    uint32_t                 deviceID[2];
    uint8_t                  identifier[12];
    uint32_t                 firmware_version;
    ble_uuid_t adv_uuids[] = {{BLUETRACK_UUID_SERVICE, m_bluetrack.uuid_type}};

    // Retrieve firmware version from bootloader settings page
    nrf_dfu_settings_t *p_settings = (nrf_dfu_settings_t*)BOOTLOADER_SETTINGS_PAGE_ADDR;
    firmware_version = p_settings->app_version;
    
    // Construct manufacturing data
    manuf_data.company_identifier = DREKKER_DEVELOPMENT_COMPANY_ID;

    deviceID[0] = NRF_FICR->DEVICEID[0];
    deviceID[1] = NRF_FICR->DEVICEID[1];

    NRF_LOG_INFO("deviceID[0] = 0x%x, deviceID[1] = 0x%x", deviceID[0], deviceID[1]);

