tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t             err_code;

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t                       err_code;
    ble_gatts_evt_write_t const *    p_evt_write;
    uint8_t const *                  data;
    ble_gatts_value_t                value;
    uint8_t                          m_programming_track_select_value = 0x00;
    uint8_t                          m_stop_value = 0x01;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");

            // Disable timer control of BLE LED
            err_code = nrf_drv_ppi_channel_disable(ble_led_timer_to_ble_led);
            APP_ERROR_CHECK(err_code);

            // Turn on BLE LED
            nrf_drv_gpiote_out_task_force(BLE_LED_PIN_NO, true);

            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");
      
            // Enable timer control of BLE LED
            err_code = nrf_drv_ppi_channel_enable(ble_led_timer_to_ble_led);
            APP_ERROR_CHECK(err_code);
            
            m_conn_handle = BLE_CONN_HANDLE_INVALID;

            // Remove all pending periodic speed commands
            remove_all_speed_commands();
            
            // Reset programming track selection and characteristic
            programming_track_mode = MAIN;
            nrf_drv_gpiote_out_clear(PROG_LED_PIN_NO);
            value.len = PROGRAMMING_TRACK_SELECT_CHAR_SIZE;
            value.offset = 0;
            value.p_value = &m_programming_track_select_value;
            err_code = sd_ble_gatts_value_set(m_conn_handle, m_bluetrack.programming_track_select_char_handles.value_handle, &value);
            APP_ERROR_CHECK(err_code);

            // Reset stop selection and characteristic
            nrf_drv_gpiote_out_clear(BRAKE_N_PIN_NO);
            nrf_drv_gpiote_out_set(STOP_LED_PIN_NO);
            value.len = STOP_CHAR_SIZE;
            value.offset = 0;
            value.p_value = &m_stop_value;
            err_code = sd_ble_gatts_value_set(m_conn_handle, m_bluetrack.stop_char_handles.value_handle, &value);
            APP_ERROR_CHECK(err_code);

            // Restart advertising
            advertising_start();
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                                   BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                                   NULL,
                                                   NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_WRITE:
            // Check if the Service Changed CCCD has been written to
            p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
            data = p_evt_write->data;
            // Empirically, Service Changed CCCD has handle 0xD, and is always Indicated (value is 0x2)
            // Note data is little endian
            if((p_evt_write->handle == 0xD) && (p_evt_write->len == 2) && (data[0] == 0x2)) {
                NRF_LOG_INFO("Service Changed ready to indicate, indicating now");
                err_code = gscm_service_changed_ind_send(m_conn_handle);
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


