tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/**@brief Function for initializing the log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initialising the safety checks.
 */
static void safety_init(void)
{
    ret_code_t err_code;

    // Enable the thermal interrupt
    nrf_drv_gpiote_in_event_enable(THERMAL_N_PIN_NO, true);

    // Check if thermal input is already low, and if so disable DCC
    if (!nrf_drv_gpiote_in_is_set(THERMAL_N_PIN_NO))
    {
        disable_DCC(ERROR_CODE_OVERTEMPERATURE);
    }
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize
    log_init();
    gpiote_init();
    timers_init();
    power_management_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    ppi_init();
    adc_init();
    bluetrack_init();
    safety_init();

    // Start execution
    NRF_LOG_INFO("Bluetrack started.");
    timers_start();
    advertising_start();

    // Enter main loop
    for (;;)
    {
        app_sched_execute();
        idle_state_handle();
    }
}

/**
 * @}
 */
